# MaxRiserHeight Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
StairsType..::..MaxRiserHeight Property
StairsType Class See Also
---
The maximum height of each riser on the stair element.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public double MaxRiserHeight { get; set; }
```

Visual Basic
---
```text
Public Property MaxRiserHeight As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double MaxRiserHeight {
	double get ();
	void set (double value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: The given value for maxRiserHeight must be greater than 0 and no more than 30000 feet. |

# See Also
StairsType Class
Autodesk.Revit.DB.Architecture Namespace